In [1]:
import pandas as pd
import numpy as np

## 丢失数据

In [2]:
scores = pd.DataFrame({"001": {"姓名": "小陈", "考试1": 85, "考试2": 95, "考试3": 92},  "002": {"姓名": "小李", "考试1": 91, "考试2": 92, "考试3": 94},  "003": {"姓名": "小王", "考试1": 86, "考试2": 81, "考试3": np.nan},  "004": {"姓名": "小张", "考试1": 79, "考试2": 89, "考试3": 95},  "005": {"姓名": "小赵", "考试1": 96, "考试2": 91, "考试3": 91},  "006": {"姓名": "小周", "考试1": 81, "考试2": np.nan, "考试3": 92} }).T
scores

     姓名 考试1  考试2  考试3
001  小陈  85   95   92
002  小李  91   92   94
003  小王  86   81  NaN
004  小张  79   89   95
005  小赵  96   91   91
006  小周  81  NaN   92

In [3]:
scores["考试2"]

001     95
002     92
003     81
004     89
005     91
006    NaN
Name: 考试2, dtype: object

In [4]:
scores["考试2"].isnull()

001    False
002    False
003    False
004    False
005    False
006     True
Name: 考试2, dtype: bool

In [5]:
scores["考试2"].isnull().sum()

1

In [6]:
scores

     姓名 考试1  考试2  考试3
001  小陈  85   95   92
002  小李  91   92   94
003  小王  86   81  NaN
004  小张  79   89   95
005  小赵  96   91   91
006  小周  81  NaN   92

In [7]:
scores.isnull()

        姓名    考试1    考试2    考试3
001  False  False  False  False
002  False  False  False  False
003  False  False  False   True
004  False  False  False  False
005  False  False  False  False
006  False  False   True  False

In [8]:
scores.isnull().sum()

姓名     0
考试1    0
考试2    1
考试3    1
dtype: int64

In [9]:
True + 5

6

In [10]:
False + 5

5

In [11]:
scores["考试3"]

001     92
002     94
003    NaN
004     95
005     91
006     92
Name: 考试3, dtype: object

In [12]:
scores["考试3"].isnull()

001    False
002    False
003     True
004    False
005    False
006    False
Name: 考试3, dtype: bool

In [13]:
scores[scores["考试3"].isnull()]

     姓名 考试1 考试2  考试3
003  小王  86  81  NaN

## 重复数据

In [14]:
name = pd.Series(["小陈", "小李", "小王", "小张", "小赵", "小李", "小周"])
gender = pd.Series(["女", "女", "男", "男", "女", "女", "女"])
height = pd.Series([172.5, 168.0, 178.2, 181.3, 161.7, 168.0, 158.5])
student_number = pd.Series(["001", "002", "003", "002", "005", "002", "006"])
students = pd.DataFrame({"学号": student_number, "姓名": name, "性别": gender, "身高": height})
students

    学号  姓名 性别     身高
0  001  小陈  女  172.5
1  002  小李  女  168.0
2  003  小王  男  178.2
3  002  小张  男  181.3
4  005  小赵  女  161.7
5  002  小李  女  168.0
6  006  小周  女  158.5

In [15]:
students

    学号  姓名 性别     身高
0  001  小陈  女  172.5
1  002  小李  女  168.0
2  003  小王  男  178.2
3  002  小张  男  181.3
4  005  小赵  女  161.7
5  002  小李  女  168.0
6  006  小周  女  158.5

In [16]:
students["学号"]

0    001
1    002
2    003
3    002
4    005
5    002
6    006
Name: 学号, dtype: object

In [17]:
students["学号"].duplicated()

0    False
1    False
2    False
3     True
4    False
5     True
6    False
Name: 学号, dtype: bool

In [18]:
students

    学号  姓名 性别     身高
0  001  小陈  女  172.5
1  002  小李  女  168.0
2  003  小王  男  178.2
3  002  小张  男  181.3
4  005  小赵  女  161.7
5  002  小李  女  168.0
6  006  小周  女  158.5

In [19]:
students.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [20]:
students.duplicated(subset=["学号", "性别"])

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [21]:
students[students.duplicated(subset=["学号", "性别"])]

    学号  姓名 性别     身高
5  002  小李  女  168.0

## 不一致数据

In [22]:
name = pd.Series(["小陈", "小李", "小李", "小王", "小张", "小赵", "小周"])
gender = pd.Series(["女", "女", "女", "男", "男", "女", "女"])
class_number = pd.Series(["1 班", "1班", "1 班", "一班", "二班", "2 班", "2 班"])
student_number = pd.Series(["001", "002", "002", "003", "004", "005", "006"])
students = pd.DataFrame({"学号": student_number, "姓名": name, "性别": gender, "班级": class_number})
students

    学号  姓名 性别   班级
0  001  小陈  女  1 班
1  002  小李  女   1班
2  002  小李  女  1 班
3  003  小王  男   一班
4  004  小张  男   二班
5  005  小赵  女  2 班
6  006  小周  女  2 班

In [23]:
students["班级"]

0    1 班
1     1班
2    1 班
3     一班
4     二班
5    2 班
6    2 班
Name: 班级, dtype: object

In [24]:
students["班级"].value_counts()

班级
1 班    2
2 班    2
1班     1
一班     1
二班     1
Name: count, dtype: int64

## 无效或错误数据

In [25]:
name = pd.Series(["小陈", "小李", "小李", "小王", "小张", "小赵", "小周"])
gender = pd.Series(["女", "女", "女", "男", "男", "女", "女"])
height = pd.Series([172.5, 168.0, 1168.0, 178.2, 181.3, -161.7, 158.5])
students = pd.DataFrame({"姓名": name, "性别": gender, "身高": height})
students

   姓名 性别      身高
0  小陈  女   172.5
1  小李  女   168.0
2  小李  女  1168.0
3  小王  男   178.2
4  小张  男   181.3
5  小赵  女  -161.7
6  小周  女   158.5

In [26]:
students["身高"].sort_values()

5    -161.7
6     158.5
1     168.0
0     172.5
3     178.2
4     181.3
2    1168.0
Name: 身高, dtype: float64

In [27]:
students.describe()

                身高
count     7.000000
mean    266.400000
std     416.596447
min    -161.700000
25%     163.250000
50%     172.500000
75%     179.750000
max    1168.000000